alacritty
alsa-utils
arandr
arc-gtk-theme
autoconf
autojump
automake
base
bat
batterymon-clone
binutils
bison
blueman
bluez-utils
clang
cmake
dialog
discord
dmenu
efibootmgr
emacs
exa
fakeroot
fd
file
findutils
firefox
flex
gawk
gcc
gettext
git
gnome-calculator
gparted
grep
groff
grub
gzip
htop
i3-gaps
i3lock-fancy-git
inxi
laptop-mode-tools
libnsl
libtool
light
lightdm
lightdm-gtk-greeter
lightdm-settings
lightdm-slick-greeter
linux-firmware
linux-lts
llvm
lsof
m4
make
man-db
mpd
mpv
nano
ncmpcpp
network-manager-applet
networkmanager
ntfs-3g
ntp
os-prober
pacman
patch
pavucontrol
pkgconf
polybar
pulseaudio
pulseaudio-alsa
pulseaudio-bluetooth
pulseaudio-ctl
python-i3ipc
python-notify2
python-umonitor-git
qutebrowser-git
ranger
reflector
riot-desktop
ripgrep
rofi
rustup
rxvt-unicode
rxvt-unicode-terminfo
sed
sudo
telegram-desktop
terminus-font
termsyn-font
texinfo
tmux
ttf-hack
usbutils
vi
vim
which
wireless_tools
wpa_supplicant
xf86-video-vesa
xorg-server
xorg-xmodmap
yarn
yay
youtube-dl
youtube-viewer-git
yubico-pam
yubikey-manager
zsh
zsh-autosuggestions
zsh-syntax-highlighting
